tap "1password/tap"
tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "railwaycat/emacsmacport"

brew "asdf"
brew "aws-sam-cli"
brew "awscli"
brew "clisp"
brew "cmake"
brew "colordiff"
brew "curl"
brew "direnv"
brew "ffmpeg"
brew "gawk"
brew "gcc"
brew "ghq"
brew "git"
brew "glib"
brew "gnutls"
brew "htop"
brew "httpie"
brew "ipcalc"
brew "jansson"
brew "jq"
brew "libgccjit"
brew "librsvg"
brew "mas"
brew "ninja"
brew "peco"
brew "poetry"
brew "reattach-to-user-namespace"
brew "tmux"
brew "translate-shell"
brew "tree"
brew "tree-sitter"
brew "vim"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-completions"

cask "1password"
cask "1password-cli"
cask "aquaskk"
cask "arc"
cask "blender"
cask "caffeine"
cask "cursor"
cask "docker"
cask "godot"
cask "iterm2"
cask "microsoft-remote-desktop"
cask "raycast"
cask "steam"
cask "the-unarchiver"
cask "unity-hub"
cask "visual-studio-code"
cask "vnc-viewer"
cask "webstorm"

mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Logic Pro", id: 634148309
mas "RunCat", id: 1429033973

vscode "vscode-icons-team.vscode-icons"
