tap "1password/tap"
tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "railwaycat/emacsmacport"

brew "asdf"
brew "awscli"
brew "colordiff"
brew "curl"
brew "direnv"
brew "gawk"
brew "ghq"
brew "git"
brew "htop"
brew "ipcalc"
brew "jq"
brew "mas"
brew "peco"
brew "reattach-to-user-namespace"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "vim"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-completions"

cask "1password"
cask "1password-cli"
cask "aquaskk"
cask "orion"
cask "caffeine"
cask "docker"
cask "iterm2"
cask "obsidian"
cask "raycast"
cask "the-unarchiver"
cask "visual-studio-code"

mas "Keynote", id: 409183694
mas "Pager", id: 409201541
mas "Numbers", id: 409203825
mas "Logic Pro", id: 634148309
mas "RunCat", id: 1429033973

vscode "vscode-icons-team.vscode-icons"
