tap "1password/tap"
tap "aws/tap"
tap "gcenx/wine"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "anyenv"
brew "aws-sam-cli"
brew "awscli"
brew "colordiff"
brew "curl"
brew "direnv"
brew "gawk"
brew "ghq"
brew "git"
brew "htop"
brew "httpie"
brew "ipcalc"
brew "jq"
brew "mas"
brew "peco"
brew "poetry"
brew "reattach-to-user-namespace"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "zsh-completions"

cask "1password"
cask "1password-cli"
cask "aquaskk"
cask "arc"
cask "caffeine"
cask "iterm2"
cask "microsoft-remote-desktop"
cask "raycast"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vnc-viewer"

mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "Logic Pro", id: 634148309
mas "RunCat", id: 1429033973

vscode "vscode-icons-team.vscode-icons"
